triangle_base/system/blockMeshDict



FoamFile
{
    version  2.0;
    format   ascii;
    class    dictionary;
    object   blockMeshDict;
}

convertToMeters 1.0;

vertices
(
(0.25 0 0) // 0
(0.25 0.2886751345948129 0) // 1
(-0.25 0.2886751345948129 0) // 2
(-0.25 0 0) // 3
(-0.25 -0.2886751345948129 0) // 4
(0.25 -0.2886751345948129 0) // 5
(1.25 -0.2886751345948129 0) // 6
(1.25 0 0) // 7
(1.25 0.2886751345948129 0) // 8
(1.25 1.2886751345948129 0) // 9
(0.25 1.2886751345948129 0) // 10
(-0.25 1.2886751345948129 0) // 11
(-1.25 1.2886751345948129 0) // 12
(-1.25 0.2886751345948129 0) // 13
(-1.25 0 0) // 14
(-1.25 -0.2886751345948129 0) // 15
(-1.25 -1.2886751345948129 0) // 16
(-0.25 -1.2886751345948129 0) // 17
(0.25 -1.2886751345948129 0) // 18
(1.25 -1.2886751345948129 0) // 19
(0.25 0 0.5) // 20
(0.25 0.2886751345948129 0.5) // 21
(-0.25 0.2886751345948129 0.5) // 22
(-0.25 0 0.5) // 23
(-0.25 -0.2886751345948129 0.5) // 24
(0.25 -0.2886751345948129 0.5) // 25
(1.25 -0.2886751345948129 0.5) // 26
(1.25 0 0.5) // 27
(1.25 0.2886751345948129 0.5) // 28
(1.25 1.2886751345948129 0.5) // 29
(0.25 1.2886751345948129 0.5) // 30
(-0.25 1.2886751345948129 0.5) // 31
(-1.25 1.2886751345948129 0.5) // 32
(-1.25 0.2886751345948129 0.5) // 33
(-1.25 0 0.5) // 34
(-1.25 -0.2886751345948129 0.5) // 35
(-1.25 -1.2886751345948129 0.5) // 36
(-0.25 -1.2886751345948129 0.5) // 37
(0.25 -1.2886751345948129 0.5) // 38
(1.25 -1.2886751345948129 0.5) // 39
);

blocks
(

   // block 0
   hex (3 1 2 23 21 22) simpleGrading ( 2.00000e+00  1.00000e+00 1.0)

   // block 1
   hex (4 5 3 24 25 23) simpleGrading ( 2.00000e+00  1.00000e+00 1.0)

   // block 2
   hex (5 6 8 1 25 26 28 21) simpleGrading ( 2.00000e+00  1.00000e+00 1.0)

   // block 3
   hex (1 8 9 10 21 28 30 29) simpleGrading ( 2.00000e+00  1.00000e+00 1.0)

   // block 4
   hex (2 1 10 11 22 21 30 34) simpleGrading ( 2.00000e+00  1.00000e+00 1.0)

   // block 5
   hex (13 2 11 12 36 22 34 35) simpleGrading ( 2.00000e+00  1.00000e+00 1.0)

   // block 6
   hex (15 4 2 13 38 24 22 36) simpleGrading ( 2.00000e+00  1.00000e+00 1.0)

   // block 7
   hex (16 17 4 15 39 40 24 38) simpleGrading ( 2.00000e+00  1.00000e+00 1.0)

   // block 8
   hex (27 18 5 4 40 41 25 24) simpleGrading ( 2.00000e+00  1.00000e+00 1.0)

   // block 9
   hex (18 19 6 5 41 42 26 25) simpleGrading ( 2.00000e+00  1.00000e+00 1.0)



);



boundary
(

  inlet
  {
      type patch;
      faces
      (
	(12 35 36 13)
	(13 36 38 15)
	(15 38 39 16)
      );
  }

  outlet
  {
      type patch;
      faces
      (
         (9 29 28 8)
         (8 28 26 6)
         (6 26 42 19)
      );
  }

  triangle
  {
      type wall;
      faces
      (
         (5 25 21 1)
         (1 21 3 23)
         (3 23 25 5)

      );
  }

  top
  {
      type symmetryPlane;
      faces
      (
         (12 35 34 11)
         (11 34 30 10)
         (10 30 29 9)

      );
  }

  bottom
  {
      type symmetryPlane;
      faces
      (
         (16 39 40 17)
         (17 40 41 18)
         (18 41 42 19)
      );
  }

);
